УТ_для_edt/src/Documents/смартASP_ВводЗнаний/смартASP_ВводЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартASP_ВводЗнаний</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <registerRecords>InformationRegister.смартASP_ТаблицаЗнаний</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартСтатусРасчетаБонусов</name>
    <comment>#1288 Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров</comment>
    <type>
      <types>EnumRef.смартСтатусыДокументовРасчетаБонусов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаЗнаний</name>
    <attributes>
      <name>Инженер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.смартASP_Категории</types>
      </type>
    </attributes>
    <attributes>
      <name>Балл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Enums/смартСтатусыДокументовРасчетаБонусов/смартСтатусыДокументовРасчетаБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыДокументовРасчетаБонусов</name>
  <comment>#1288 Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров</comment>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗавершен</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартASP_ВводЗнаний/Forms/ФормаДокумента/Module.bsl
//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если Объект.ТаблицаЗнаний.Количество() = 0 Тогда
		ПерезаполнитьТаблицуНаСервере()
	Иначе
		ЗаполнитьТаблицуИзДанныхНаСервере()
	КонецЕсли;
	
	//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров  
	Если НЕ ЗначениеЗаполнено(Объект.смартСтатусРасчетаБонусов) Тогда
		Объект.смартСтатусРасчетаБонусов = Перечисления.смартСтатусыДокументовРасчетаБонусов.ВРаботе;
	КонецЕсли;	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	

	УстановитьДоступностьПоСтатусуРасчета();
	//--#1288 смарт: Лопато 26.12.2022
	
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Процедура ЗаполнитьТаблицуИзДанныхНаСервере()
	тзТабЗнаний.Очистить();
	СписокКолонок.Очистить();
	
	тз = РеквизитФормыВЗначение("тзТабЗнаний", Тип("ТаблицаЗначений"));
	
	МассивРеквизитов = Новый Массив;
    
    //Удалим ранее созданные колонки в ТЗ    
    Для Каждого Колонка Из тз.Колонки Цикл
        МассивРеквизитов.Добавить("тзТабЗнаний." + Колонка.Имя);        
    КонецЦикла;
    ИзменитьРеквизиты(,МассивРеквизитов);
	тз.Колонки.Очистить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЕСТЬNULL(смартASP_Категории.Ссылка, ASP_ВводЗнанийТаблицаЗнаний.Категория) КАК Ссылка,
	                      |	ВЫБОР
	                      |		КОГДА смартASP_Категории.Ссылка ЕСТЬ NULL
	                      |			ТОГДА ASP_ВводЗнанийТаблицаЗнаний.Категория.Наименование
	                      |		ИНАЧЕ смартASP_Категории.Наименование
	                      |	КОНЕЦ КАК Наименование
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		ASP_ВводЗнанийТаблицаЗнаний.Ссылка КАК Ссылка,
	                      |		ASP_ВводЗнанийТаблицаЗнаний.Категория КАК Категория
	                      |	ИЗ
	                      |		Документ.смартASP_ВводЗнаний.ТаблицаЗнаний КАК ASP_ВводЗнанийТаблицаЗнаний
	                      |	ГДЕ
	                      |		ASP_ВводЗнанийТаблицаЗнаний.Ссылка = &Док) КАК ASP_ВводЗнанийТаблицаЗнаний
	                      |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			смартASP_Категории.Ссылка КАК Ссылка,
	                      |			смартASP_Категории.Наименование КАК Наименование
	                      |		ИЗ
	                      |			Справочник.смартASP_Категории КАК смартASP_Категории
	                      |		ГДЕ
	                      |			смартASP_Категории.Активен
	                      |			И НЕ смартASP_Категории.ПометкаУдаления) КАК смартASP_Категории
	                      |		ПО ASP_ВводЗнанийТаблицаЗнаний.Категория = смартASP_Категории.Ссылка
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Наименование");
	Запрос.УстановитьПараметр("Док", Объект.Ссылка);
	Рез = Запрос.Выполнить().Выгрузить();
	
	тз.Колонки.Добавить("Инженер", Новый ОписаниеТипов("СправочникСсылка.Пользователи"), "Инженер");
	
	сч = 0;
	Для Каждого стр Из Рез Цикл
		Если СписокКолонок.НайтиПоЗначению(стр.Наименование) <> Неопределено Тогда
			Продолжить
		КонецЕсли;
		
		сч=сч+1;
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Число"));
		ПараметрыЧисла = Новый КвалификаторыЧисла(5,2,ДопустимыйЗнак.Любой);

		ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов, , ПараметрыЧисла);

		тз.Колонки.Добавить("Колонка"+Формат(сч, "ЧГ=0"), ДопустимыеТипы, стр.Наименование);
		
		СписокКолонок.Добавить(стр.Наименование, "Колонка"+Формат(сч, "ЧГ=0"));
	КонецЦикла;
	Для Каждого стр Из Объект.ТаблицаЗнаний Цикл
		мСтрок = тз.НайтиСтроки(Новый Структура("Инженер", стр.Инженер));
		Если мСтрок.Количество() = 0 Тогда
			нов = тз.Добавить();
			нов.Инженер = стр.Инженер;
		Иначе
			нов = мСтрок[0]
		КонецЕсли;
		
		кол = СписокКолонок.НайтиПоЗначению(стр.Категория.Наименование);
		Если кол <> Неопределено Тогда
			нов[кол.Представление] = стр.Балл
		КонецЕсли;
	КонецЦикла;
	
	//////////////////
	ЭлементТаблица = Элементы.Найти("тзТабЗнаний");
    Если ЭлементТаблица <> Неопределено Тогда
        Элементы.Удалить(ЭлементТаблица);        
    КонецЕсли;     
    
    ЭлементТаблица=Элементы.Добавить("тзТабЗнаний", Тип("ТаблицаФормы"), Элементы.ГруппаТаблицы);
    ЭлементТаблица.ПутьКДанным = "тзТабЗнаний";
    ЭлементТаблица.Отображение = ОтображениеТаблицы.Список;
	ЭлементТаблица.УстановитьДействие("ПриИзменении", "тзТабЗнанийПриИзменении");
	
	//Создадим реквизиты ТЗ
    МассивРеквизитов.Очистить();
    Для Каждого Колонка ИЗ тз.Колонки Цикл
        НоваяКолонка = Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "тзТабЗнаний", Колонка.Заголовок);
        МассивРеквизитов.Добавить(НоваяКолонка);
    КонецЦикла;      
    ИзменитьРеквизиты(МассивРеквизитов);
	ЗначениеВРеквизитФормы(тз, "тзТабЗнаний");
	
	Для Каждого Колонка ИЗ тз.Колонки Цикл
        НовыйЭлементФормы = Элементы.Добавить("тзТабЗнаний"+Колонка.Имя, Тип("ПолеФормы"), Элементы.тзТабЗнаний);
        НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
        НовыйЭлементФормы.ПутьКДанным = "тзТабЗнаний." + Колонка.Имя;
		НовыйЭлементФормы.Заголовок = Колонка.Заголовок;
	КонецЦикла;

КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Процедура ПерезаполнитьТаблицуНаСервере()
	тзТабЗнаний.Очистить();
	СписокКолонок.Очистить();
	
	тз = РеквизитФормыВЗначение("тзТабЗнаний", Тип("ТаблицаЗначений"));
	
	МассивРеквизитов = Новый Массив;
    
    //Удалим ранее созданные колонки в ТЗ    
    Для Каждого Колонка Из тз.Колонки Цикл
        МассивРеквизитов.Добавить("тзТабЗнаний." + Колонка.Имя);        
    КонецЦикла;
    ИзменитьРеквизиты(,МассивРеквизитов);
	тз.Колонки.Очистить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	смартASP_Категории.Ссылка КАК Ссылка,
	                      |	смартASP_Категории.Наименование КАК Наименование
	                      |ИЗ
	                      |	Справочник.смартASP_Категории КАК смартASP_Категории
	                      |ГДЕ
	                      |	смартASP_Категории.Активен
	                      |	И НЕ смартASP_Категории.ПометкаУдаления
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Наименование");
	Рез = Запрос.Выполнить().Выгрузить();
	
	тз.Колонки.Добавить("Инженер", Новый ОписаниеТипов("СправочникСсылка.Пользователи"), "Инженер");
	
	сч = 0;
	Для Каждого стр Из Рез Цикл
		Если СписокКолонок.НайтиПоЗначению(стр.Наименование) <> Неопределено Тогда
			Продолжить
		КонецЕсли;
		
		сч=сч+1;
		
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(Тип("Число"));
		ПараметрыЧисла = Новый КвалификаторыЧисла(5,2,ДопустимыйЗнак.Любой);

		ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов, , ПараметрыЧисла);

		тз.Колонки.Добавить("Колонка"+Формат(сч, "ЧГ=0"), ДопустимыеТипы, стр.Наименование);
		
		СписокКолонок.Добавить(стр.Наименование, "Колонка"+Формат(сч, "ЧГ=0"));
	КонецЦикла;
	
	//////////////////
	ЭлементТаблица = Элементы.Найти("тзТабЗнаний");
    Если ЭлементТаблица <> Неопределено Тогда
        Элементы.Удалить(ЭлементТаблица);        
    КонецЕсли;     
    
    ЭлементТаблица=Элементы.Добавить("тзТабЗнаний", Тип("ТаблицаФормы"), Элементы.ГруппаТаблицы);
    ЭлементТаблица.ПутьКДанным = "тзТабЗнаний";
    ЭлементТаблица.Отображение = ОтображениеТаблицы.Список;
	ЭлементТаблица.УстановитьДействие("ПриИзменении", "тзТабЗнанийПриИзменении");
	
	//Создадим реквизиты ТЗ
    МассивРеквизитов.Очистить();
    Для Каждого Колонка ИЗ тз.Колонки Цикл
        НоваяКолонка = Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "тзТабЗнаний", Колонка.Заголовок);
        МассивРеквизитов.Добавить(НоваяКолонка);
    КонецЦикла;      
    ИзменитьРеквизиты(МассивРеквизитов);
	ЗначениеВРеквизитФормы(тз, "тзТабЗнаний");
	
	Для Каждого Колонка ИЗ тз.Колонки Цикл
        НовыйЭлементФормы = Элементы.Добавить("тзТабЗнаний"+Колонка.Имя, Тип("ПолеФормы"), Элементы.тзТабЗнаний);
        НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
        НовыйЭлементФормы.ПутьКДанным = "тзТабЗнаний." + Колонка.Имя;
		НовыйЭлементФормы.Заголовок = Колонка.Заголовок;
	КонецЦикла;
	
	ЭтаФорма.Модифицированность = Истина
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура ПерезаполнитьТаблицу(Команда)
	Если тзТабЗнаний.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПерезаполнитьТаблицуВопрос", ЭтаФорма), "Таблица знаний будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ПерезаполнитьТаблицуЗавершение();
	КонецЕсли;
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура ПерезаполнитьТаблицуВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат
	КонецЕсли;
	
	ПерезаполнитьТаблицуЗавершение();

КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура ПерезаполнитьТаблицуЗавершение()
	
	ПерезаполнитьТаблицуНаСервере();
	
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура тзТабЗнанийПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	тз = РеквизитФормыВЗначение("тзТабЗнаний", Тип("ТаблицаЗначений"));
	тз.Колонки.Добавить("Счетчик");
	тз.ЗаполнитьЗначения(1, "Счетчик");
	тз.Свернуть("Инженер", "Счетчик");
	тз.Сортировать("Счетчик УБЫВ");
	Для Каждого стр Из тз Цикл
		Если стр.Счетчик < 2 Тогда
			Прервать
		КонецЕсли;
		Сообщить("Введено больше одной строки для инженера " + стр.Инженер, СтатусСообщения.ОченьВажное);
		Отказ = Истина
	КонецЦикла;
	
	Если НЕ Отказ Тогда
		
		тз = РеквизитФормыВЗначение("тзТабЗнаний", Тип("ТаблицаЗначений"));
		Для Каждого кол Из тз.Колонки Цикл
			Для Каждого тек Из СписокКолонок Цикл
				Если тек.Представление = кол.Имя Тогда
					кол.Заголовок = тек.Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ТаблицаЗнаний", тз);
		
		//++#1288 смарт: Лопато 20.01.2023 //Правка ошибки, при которой удаляются данные ТЧ при записи не из формы  
		ТекущийОбъект.ТаблицаЗнаний.Очистить();
		Для Каждого стр Из тз Цикл
			Для Каждого кол Из тз.Колонки Цикл
				Если кол.Имя = "Инженер" Тогда
					Продолжить;
				КонецЕсли;
				
				нов = ТекущийОбъект.ТаблицаЗнаний.Добавить();
				нов.Инженер = стр.Инженер;
				нов.Категория = Справочники.смартASP_Категории.НайтиПоНаименованию(кол.Заголовок);
				нов.Балл = стр[кол.Имя]
			КонецЦикла;
		КонецЦикла;	
		//--#1288 смарт: Лопато 20.01.2023
		
	КонецЕсли;
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.Номер = ""
КонецПроцедуры

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура УстановитьДоступностьПоСтатусуРасчета()

	смартASP_ОбщийМодуль.смартУстановитьТолькоПросмотрФормыРасчетЗавершен(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьДоступностьПоСтатусуРасчета();

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

#Область ПодключаемыеКоманды

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

#КонецОбласти

#Область ОбработчикиКомандФормы

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

&НаСервере
//++ #Б-1006 смарт: Фролов 27.09.2024 //Доработка механизма учета знаний.
Процедура УдалитьКатегориюНаСервере()
	
	СтруктураДляПоиска = Новый Структура("Категория", УдаляемаяКатегория);
	
	МассивСтрокУдалить = Объект.ТаблицаЗнаний.НайтиСтроки(СтруктураДляПоиска);
	Для Каждого Строка Из МассивСтрокУдалить Цикл
		Объект.ТаблицаЗнаний.Удалить(Строка);
	КонецЦикла;
	
	СписокКолонок.Удалить(СписокКолонок.НайтиПоЗначению(УдаляемаяКатегория.Наименование));
	
	Записать();
	ЗаполнитьТаблицуИзДанныхНаСервере();
	
КонецПроцедуры //-- #Б-1006 смарт: Фролов 27.09.2024

&НаКлиенте
//++ #Б-1006 смарт: Фролов 27.09.2024 //Доработка механизма учета знаний.
Процедура УдалитьКатегорию(Команда)
	УдалитьКатегориюНаСервере();
КонецПроцедуры //-- #Б-1006 смарт: Фролов 27.09.2024

#КонецОбласти
